**instalacja niezbędnych pakietów**

In [1]:
pip install sqlalchemy psycopg2 pandas

Requirement already satisfied: sqlalchemy in c:\users\to_ja\anaconda3\lib\site-packages (1.3.5)
Requirement already satisfied: psycopg2 in c:\users\to_ja\anaconda3\lib\site-packages (2.9.5)
Requirement already satisfied: pandas in c:\users\to_ja\anaconda3\lib\site-packages (0.24.2)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\to_ja\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.12.0 in c:\users\to_ja\anaconda3\lib\site-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2011k in c:\users\to_ja\anaconda3\lib\site-packages (from pandas) (2019.1)
Requirement already satisfied: six>=1.5 in c:\users\to_ja\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

**Połączenie z bazą danych**

In [2]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

In [3]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [4]:
result_set = db.execute("SELECT category_id FROM category")  #opcja ASC jest domyślna, ORDER BY name ASC nie jest więc niezbędna do wykonania ćwiczenia (funkcja wykrzystana aby pokazać, że była wybrana celowo nie przez przypadek)

In [5]:
df = pd.read_sql('select * from city',con=connection)

In [6]:
df = pd.read_sql('select * from city', con=connection_sqlalchemy)

**Ćwiczenie nr 1**
Ile kategorii filmów mamy w wypożyczalni?

In [7]:
#result_set = db.execute("SELECT category_id FROM category")  #opcja ASC jest domyślna, ORDER BY name ASC nie jest więc niezbędna do wykonania ćwiczenia (funkcja wykrzystana aby pokazać, że była wybrana celowo nie przez przypadek)
#for r in result_set:  
#    print(r)
result_set2 = pd.read_sql('SELECT COUNT(DISTINCT category_id) FROM film_category',con=connection_sqlalchemy) #category nie działa, film_category już tak?   
result_set2

   count
0     16

**Ćwiczenie nr 2** Wyświetl listę kategorii w kolejności alfabetycznej.

In [8]:
#result_set = db.execute("SELECT name FROM category ORDER BY name ASC")  #opcja ASC jest domyślna, ORDER BY name ASC nie jest więc niezbędna do wykonania ćwiczenia (funkcja wykrzystana aby pokazać, że była wybrana celowo nie przez przypadek)
#for r in result_set:  
#    print(r)
result_set = pd.read_sql('select name from category ORDER BY name ASC',con=connection_sqlalchemy)
result_set

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

**Ćwiczenie nr 3** Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [9]:
#result_set = db.execute("SELECT title FROM film WHERE release_year != '2006'")  #opcja ASC jest domyślna, ORDER BY name ASC nie jest więc niezbędna do wykonania ćwiczenia (funkcja wykrzystana aby pokazać, że była wybrana celowo nie przez przypadek)
#for r in result_set:  
#    print(r)
result_set = pd.read_sql('SELECT title FROM film WHERE release_year != 2006',con=connection_sqlalchemy)
result_set

#SELECT select_list
#FROM table_name
#WHERE condition

Empty DataFrame
Columns: [title]
Index: []

Filmy w bazie danych posiadają tą samą date wydania

**Ćwiczenie nr 4** Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [10]:
result_set = pd.read_sql("SELECT COUNT(*) FROM rental WHERE rental_date > '2005-07-01 00:00:00' AND rental_date < '2005-08-01 23:59:59'",con=connection_sqlalchemy)
result_set

   count
0   7380

**Ćwiczenie nr 5** Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [11]:
result_set = pd.read_sql("SELECT * FROM rental WHERE rental_date > '2010-01-01 00:00:00' AND rental_date < '2011-02-01 23:59:59'",con=connection_sqlalchemy)
result_set

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update]
Index: []

In [12]:
result_set = pd.read_sql("SELECT * FROM rental WHERE rental_date < '2011-02-01 23:59:59'",con=connection_sqlalchemy)
result_set.rental_date.max()

Timestamp('2006-02-14 15:16:03')

Drugi kawałek kodu pokazuje, że najpóźniej wypożyczony film ukazany w bazie danych był w 2006 roku, długo przed minimalną datą w 2010 roku

**Ćwiczenie nr 6** Znajdź największą płatność wypożyczenia.

In [20]:
result_set = pd.read_sql("SELECT MAX(amount) FROM payment",con=connection_sqlalchemy)
result_set

     max
0  11.99

lub

In [21]:
result_set = pd.read_sql("SELECT * FROM payment ORDER BY amount DESC LIMIT 8",con=connection_sqlalchemy)
result_set

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,24553,195,2,16040,11.99,2007-03-23 20:47:59.996577
1,28814,592,1,3973,11.99,2007-04-06 21:26:57.996577
2,22650,204,2,15415,11.99,2007-03-22 22:17:22.996577
3,23757,116,2,14763,11.99,2007-03-21 22:02:26.996577
4,24866,237,2,11479,11.99,2007-03-02 20:46:39.996577
5,28799,591,2,4383,11.99,2007-04-07 19:14:17.996577
6,20403,362,1,14759,11.99,2007-03-21 21:57:24.996577
7,29136,13,2,8831,11.99,2007-04-29 21:06:07.996577

Druga przedstawiona metoda pozwala na dogodniejsze sprawdzenie poprzez zmiane opcji LIMIT, informacje inne niż samo "amount" zostaną też zachowane. Poprzez manualne sprawdzenie za pomocą parametru LIMIT, wykryto 8 wypożyczeń z tą samą maksymalną ceną

**Ćwiczenie nr 7** Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [22]:
test="SELECT * FROM country WHERE country IN ('Nigeria','Poland','Bangladesh')"
result_set = pd.read_sql(test,con=connection_sqlalchemy)
#result_set.country_id
#Id krajów, które spłniają warunki zadania

result_str = str(result_set.country_id.tolist())
result_str = '(' + result_str[1:]
result_str = result_str[:-1] + ')'
list_countries = "SELECT * FROM city WHERE country_id IN " + result_str
result_set2 = pd.read_sql(list_countries,con=connection_sqlalchemy)
#result_set2.city_id
#Id miast, które spłniają warunki zadania

result_str2 = str(result_set2.city_id.tolist())
result_str2 = '(' + result_str2[1:]
result_str2 = result_str2[:-1] + ')'
list_cities = "SELECT * FROM address WHERE city_id IN " + result_str2

result_set3 = pd.read_sql(list_cities,con=connection_sqlalchemy)
#result_set3.address_id
#Id adresów, które spłniają warunki zadania

result_str3 = str(result_set3.address_id.tolist())
result_str3 = '(' + result_str3[1:]
result_str3 = result_str3[:-1] + ')'
list_addresses = "SELECT * FROM customer WHERE address_id IN " + result_str3

result_finalset = pd.read_sql(list_addresses,con=connection_sqlalchemy)
result_finalset

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,18,2,Carol,Garcia,carol.garcia@sakilacustomer.org,22,True,2006-02-14,2013-05-26 14:49:45.738,1
1,21,1,Michelle,Clark,michelle.clark@sakilacustomer.org,25,True,2006-02-14,2013-05-26 14:49:45.738,1
2,80,1,Marilyn,Ross,marilyn.ross@sakilacustomer.org,84,True,2006-02-14,2013-05-26 14:49:45.738,1
3,103,1,Gladys,Hamilton,gladys.hamilton@sakilacustomer.org,107,True,2006-02-14,2013-05-26 14:49:45.738,1
4,128,1,Marjorie,Tucker,marjorie.tucker@sakilacustomer.org,132,True,2006-02-14,2013-05-26 14:49:45.738,1
5,156,1,Bertha,Ferguson,bertha.ferguson@sakilacustomer.org,160,True,2006-02-14,2013-05-26 14:49:45.738,1
6,198,2,Elsie,Kelley,elsie.kelley@sakilacustomer.org,202,True,2006-02-14,2013-05-26 14:49:45.738,1
7,232,2,Constance,Reid,constance.reid@sakilacustomer.org,236,True,2006-02-14,2013-05-26 14:49:45.738,1
8,250,2,Jo,Fowler,jo.fowler@sakilacustomer.org,254,True,2006-02-14,2013-05-26 14:49:45.738,1
9,270,1,Leah,Curtis,leah.curtis@sakilacustomer.org,275,True,2006-02-14,2013-05-26 14:49:45.738,1
10,277,2,Olga,Jimenez,olga.jimenez@sakilacustomer.org,282,True,2006-02-14,2013-05-26 14:49:45.738,1
11,280,2,Tracey,Barrett,tracey.barrett@sakilacustomer.org,285,True,2006-02-14,2013-05-26 14:49:45.738,1
12,284,1,Sonia,Gregory,sonia.gregory@sakilacustomer.org,289,True,2006-02-14,2013-05-26 14:49:45.738,1
13,286,1,Velma,Lucas,velma.lucas@sakilacustomer.org,291,True,2006-02-14,2013-05-26 14:49:45.738,1
14,318,1,Brian,Wyman,brian.wyman@sakilacustomer.org,323,True,2006-02-14,2013-05-26 14:49:45.738,1
15,329,2,Frank,Waggoner,frank.waggoner@sakilacustomer.org,334,True,2006-02-14,2013-05-26 14:49:45.738,1
16,332,1,Stephen,Qualls,stephen.qualls@sakilacustomer.org,337,True,2006-02-14,2013-05-26 14:49:45.738,1
17,380,1,Russell,Brinson,russell.brinson@sakilacustomer.org,385,True,2006-02-14,2013-05-26 14:49:45.738,1
18,409,2,Rodney,Moeller,rodney.moeller@sakilacustomer.org,414,True,2006-02-14,2013-05-26 14:49:45.738,1
19,501,1,Ruben,Geary,ruben.geary@sakilacustomer.org,506,True,2006-02-14,2013-05-26 14:49:45.738,1
20,558,1,Jimmie,Eggleston,jimmie.eggleston@sakilacustomer.org,564,True,2006-02-14,2013-05-26 14:49:45.738,0
21,562,1,Wallace,Slone,wallace.slone@sakilacustomer.org,568,True,2006-02-14,2013-05-26 14:49:45.738,1
22,571,2,Johnnie,Chisholm,johnnie.chisholm@sakilacustomer.org,577,True,2006-02-14,2013-05-26 14:49:45.738,1
23,572,1,Sidney,Burleson,sidney.burleson@sakilacustomer.org,578,True,2006-02-14,2013-05-26 14:49:45.738,1

**Ćwiczenie nr 8** Gdzie mieszkają członkowie personelu?

In [23]:
result_set = pd.read_sql("SELECT * FROM staff",con=connection_sqlalchemy)
#result_set.address_id
#adresy pracowników

result_str = str(result_set.address_id.tolist())
result_str = '(' + result_str[1:]
result_str = result_str[:-1] + ')'
list_addresses = "SELECT * FROM address WHERE address_id IN " + result_str
result_set2 = pd.read_sql(list_addresses,con=connection_sqlalchemy)
#result_set2.city_id
#Id miast, które spłniają warunki zadania

result_str2 = str(result_set2.city_id.tolist())
result_str2 = '(' + result_str2[1:]
result_str2 = result_str2[:-1] + ')'
list_cities = "SELECT * FROM city WHERE city_id IN " + result_str2

result_set3 = pd.read_sql(list_cities,con=connection_sqlalchemy)
#result_set3.country_id
#Id krajów, które spłniają warunki zadania

result_str3 = str(result_set3.country_id.tolist())
result_str3 = '(' + result_str3[1:]
result_str3 = result_str3[:-1] + ')'
list_countries = "SELECT * FROM country WHERE country_id IN " + result_str3
result_finalset = pd.read_sql(list_countries,con=connection_sqlalchemy)
result_finalset

   country_id    country         last_update
0           8  Australia 2006-02-15 09:44:00
1          20     Canada 2006-02-15 09:44:00

In [24]:
result_set2

,address_id,address,address2,district,city_id,postal_code,phone,last_update
0,3,23 Workhaven Lane,None,Alberta,300,,14033335568,2006-02-15 09:45:30
1,4,1411 Lillydale Drive,None,QLD,576,,6172235589,2006-02-15 09:45:30

Pracownicy mieszkają w Australi i Kanadzie

**Ćwiczenie nr 9** Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [25]:
list_countries = "SELECT * FROM country WHERE country IN ('Argentina','Spain') AND country_id IN " + result_str3
result_finalset = pd.read_sql(list_countries,con=connection_sqlalchemy)
result_finalset

Empty DataFrame
Columns: [country_id, country, last_update]
Index: []

Korzystając z kodu z ćwiczenia 8, w tych krajach mieszka 0 pracowników

**Ćwiczenie nr 10** Jakie kategorie filmów zostały wypożyczone przez klientów?

In [26]:
result_set = pd.read_sql("SELECT inventory_id FROM rental",con=connection_sqlalchemy)
#result_set.inventory_id
#id inventory filmów, które zostały kiedyś wypożyczone

result_str = str(result_set.inventory_id.tolist())
result_str = '(' + result_str[1:-1]+ ')'
list_inventory = "SELECT * FROM inventory WHERE inventory_id IN " + result_str
result_set2 = pd.read_sql(list_inventory,con=connection_sqlalchemy)
#result_set2.film_id
#id filmów filmów, które zostały kiedyś wypożyczone

result_str2 = '(' + str(result_set2.film_id.tolist())[1:-1]+ ')'
list_film = "SELECT DISTINCT category_id FROM film_category WHERE film_id IN " + result_str2
result_set3 = pd.read_sql(list_film,con=connection_sqlalchemy)
result_set3

    category_id
0            11
1             9
2            15
3             3
4             5
5             4
6            10
7             6
8            14
9            13
10            2
11           16
12            7
13           12
14            1
15            8

Zgodnie z wynikiem zadania drugiego, liczba unikalnym id kategori jest taka sama jak liczba wszystkich kategori w zadaniu 2, to znaczy, wypożyczony został film z każdej kategorii. Pożądana lista kategori pokrywa się więc z wynikową listą z zadania 2.

**Ćwiczenie nr 11** Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce

In [27]:
test="SELECT * FROM country WHERE country IN ('United States')"
result_set = pd.read_sql(test,con=connection_sqlalchemy)
#result_set.country_id
#Id krajów, które spłniają warunki zadania

result_str = str(result_set.country_id.tolist())
result_str = '(' + result_str[1:]
result_str = result_str[:-1] + ')'
list_countries = "SELECT * FROM city WHERE country_id IN " + result_str
result_set2 = pd.read_sql(list_countries,con=connection_sqlalchemy)
#result_set2.city_id
#Id miast, które spłniają warunki zadania

result_str2 = str(result_set2.city_id.tolist())
result_str2 = '(' + result_str2[1:]
result_str2 = result_str2[:-1] + ')'
list_cities = "SELECT * FROM address WHERE city_id IN " + result_str2

result_set3 = pd.read_sql(list_cities,con=connection_sqlalchemy)
#result_set3.address_id
#Id adresów, które spłniają warunki zadania

result_str3 = str(result_set3.address_id.tolist())
result_str3 = '(' + result_str3[1:]
result_str3 = result_str3[:-1] + ')'
list_addresses = "SELECT * FROM customer WHERE address_id IN " + result_str3

result_finalset = pd.read_sql(list_addresses,con=connection_sqlalchemy)
result_finalsetpart2=result_finalset

In [28]:
result_strpart2 = '(' + str(result_finalsetpart2.customer_id.tolist())[1:-1]+ ')'
list_customers = "SELECT inventory_id FROM rental WHERE customer_id IN " + result_str3

result_set = pd.read_sql(list_customers,con=connection_sqlalchemy)
#result_set.inventory_id
#id inventory filmów, które zostały kiedyś wypożyczone

result_str = str(result_set.inventory_id.tolist())
result_str = '(' + result_str[1:-1]+ ')'
list_inventory = "SELECT * FROM inventory WHERE inventory_id IN " + result_str
result_set2 = pd.read_sql(list_inventory,con=connection_sqlalchemy)
#result_set2.film_id
#id filmów filmów, które zostały kiedyś wypożyczone

result_str2 = '(' + str(result_set2.film_id.tolist())[1:-1]+ ')'
list_film = "SELECT DISTINCT category_id FROM film_category WHERE film_id IN " + result_str2
result_set3 = pd.read_sql(list_film,con=connection_sqlalchemy)
result_set3

    category_id
0            11
1             9
2            15
3             3
4             5
5             4
6            10
7             6
8            14
9            13
10            2
11           16
12            7
13           12
14            1
15            8

USA posiada już wszystkie możliwe kategorie, tak więc nawet jeżeli ameryka z zadania odnosi się do kontynentu, można  stwierdzić że w tym kontynencie pożyczona jest każda kategoria. Pożądana lista kategori pokrywa się więc z wynikową listą z zadania 2.

**Ćwiczenie nr 12** Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [29]:
test="SELECT * FROM actor WHERE first_name IN ('Olympia') AND last_name IN ('Pfeiffer') OR first_name IN ('Julia') AND last_name IN ('Zellweger') OR first_name IN ('Ellen') AND last_name IN ('Presley')"
result_set = pd.read_sql(test,con=connection_sqlalchemy)
#result_set.actor_id
#id aktorów z zadania

result_str = '(' + str(result_set.actor_id.tolist())[1:-1]+ ')'
list_actors = "SELECT film_id FROM film_actor WHERE actor_id IN " + result_str
result_set2 = pd.read_sql(list_actors,con=connection_sqlalchemy)
#result_set2.film_id

result_str2 = '(' + str(result_set2.film_id.tolist())[1:-1]+ ')'
list_film = "SELECT title FROM film WHERE film_id IN " + result_str2
result_set3 = pd.read_sql(list_film,con=connection_sqlalchemy)
result_set3

                     title
0              Badman Dawn
1          Bilko Anonymous
2     Breakfast Goldfinger
3        Caribbean Liberty
4         Casper Dragonfly
5              Chitty Lock
6       Color Philadelphia
7        Contact Anonymous
8         Cranes Reservoir
9              Dares Pluto
10            Deep Crusade
11        Detective Vision
12         Divorce Shining
13        Effect Gladiator
14        Empire Malkovich
15          Express Lonely
16       Firehouse Vietnam
17           Floats Garden
18        Frogmen Breaking
19        Fugitive Maguire
20           Hanky October
21         Hollow Jeopardy
22          Homeward Cider
23         Idols Snatchers
24             Hyde Doctor
25            Ice Crossing
26          Image Princess
27  Intolerable Intentions
28           Jacket Frisco
29         Jeopardy Encino
..                     ...
39            None Spiking
40            Open African
41              Oscar Gold
42             Others Soup
43            Outlaw Hanky
44         Panky Submarine
45          Pickup Driving
46         Pinocchio Simon
47            Private Drop
48           Psycho Shrunk
49        Rider Caddyshack
50          Roots Remember
51             Santa Paris
52           Scarface Bang
53         Secretary Rouge
54             Sense Greek
55                Spy Mile
56         Storm Happiness
57    Streetcar Intentions
58       Sweet Brotherhood
59            Tadpole Park
60        Titanic Boondock
61         Tourist Pelican
62          Traffic Hobbit
63        Treasure Command
64               Turn Star
65              Wait Cider
66            Women Dorado
67               Won Dares
68           Wyoming Storm

[69 rows x 1 columns]